Repository: LockeBirdsey/TwEGeT
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: ru

source: Locating dependencies...
ru: Поиск зависимостей ...

source: Locating and importing exising settings...
ru: Поиск и импорт существующих настроек ...

source: Project Name
ru: название проекта

source: Author Name
ru: Имя автора

source: Your Name
ru: Ваше имя

source: Version
ru: Версия

source: Project Directory
ru: Каталог проектов

source: Project HTML File
ru: HTML-файл проекта

source: Project Output Directory
ru: Каталог выходных данных проекта

source: Where you want the executable to be stored
ru: Где вы хотите сохранить исполняемый файл

source: Project Details
ru: Подробности проекта

source: Email
ru: Эл. адрес

source: Repository
ru: хранилище

source: Window Width
ru: Ширина окна

source: Window Height
ru: Высота окна

source: Icon Location
ru: Расположение значка

source: Automatically create an icon and assign it to the executable
ru: Автоматически создать иконку и назначить ее исполняемому файлу

source: Author Details
ru: Сведения об авторе

source: Open Existing Project
ru: Открыть существующий проект

source: Setup New Build Files
ru: Установить новые файлы сборки

source: Sets up the project build directory by installing various Electron packages
ru: Устанавливает каталог сборки проекта путем установки различных Electron пакеты

source: Update Information
ru: Обновить информацию

source: Build for
ru: Построить для

source: Build for Web
ru: Сборка для веба

source: The Project Organiser parses a Twine Story HTML file for various media (images, audio, video),copies them and your HTML file to the selected output directory in a neat structure and attempts to replace the links in your Story with the new ones, so that the Story will behave correctly.
ru: Организатор проекта анализирует HTML-файл Twine Story для различных носителей(изображения, аудио, видео), копирует их и ваш HTML-файл в выбранное

source: Twine HTML File
ru: Twine HTML-файл

source: Output Directory
ru: Выходной каталог

source: Organise
ru: организовать

source: Project Organiser
ru: Организатор проекта

source: This tool can be used to create icons (for anything). Select the image you wish to use, and generate ICO (Windows icon format) and ICNS (macOS icon format) using those respective systems
ru: Этот инструмент можно использовать для создания иконок (для чего угодно). Выберите изображениевы хотите использовать, nи генерировать ICO (формат значков Windows) и ICNS (формат значков macOS) с использованием этих соответствующих систем

source: Icon Destination
ru: Значок Назначение

source: Image Preview
ru: Предварительный просмотр изображения

source: Convert
ru: Конвертировать

source: Icon Creator
ru: Создатель Иконок

source: NPM and NPX are required to use the executable generator. TweeGo is required to use the Project Organiser
ru: NPM и NPX обязаны использовать исполняемый генератор. TweeGo необходимо использовать Организатор проекта"

source: NPM Location
ru: Расположение NPM

source: NPX Location
ru: Расположение NPX

source: TweeGo Location
ru: Расположение TweeGo

source: Libraries
ru: Библиотеки

source: Executable Generator
ru: Исполняемый генератор

source: IconCreator
ru: Создатель Иконок

source: Library Info
ru: Информация библиотеки

source: Open Twine2 Directory (Local)
ru: Откройте каталог Twine2 (локальный)

source: Help
ru: Помогите

source: About
ru: Около

source: Exit
ru: покидать

source: Twine Executable Generation Tool
ru: Twine исполняемый инструмент генерации

source: About TwEGeT
ru: O TwEGeT

source: Error with loading icon image
ru: Ошибка при загрузке изображения значка

source: An error occurred. If needed, submit the following error message to the TwET Github.
ru: Произошла ошибка. При необходимости отправьте следующее сообщение об ошибке вТвит Github.

source: Updating project files located at
ru: Обновление файлов проекта, расположенных на

source: Existing project file could not be loaded.
ru: Не удалось загрузить существующий файл проекта.

source: Help with TwEGeT
ru: Помогите с TwET

source: A config file has been detected at Will load its contents
ru: Конфигурационный файл был обнаружен в nЗагрузит его содержимое

source: Either NPM or NPX are unable to be found which means the project cannot be built. Please locate them using the "Library Info" Tab
ru: Либо NPM, либо NPX не могут быть найдены, что означает, что проект не можетбыть построенным. nПожалуйста, найдите их, используя вкладку« Информация о библиотеке

source: Building executable for
ru: Сборка исполняемого файла для

source: Creating
ru: Создание

source: compatible icons
ru: совместимые значки

source: Zip file located at .zip
ru: Zip-файл находится по адресу .zip

source: Building lock file at
ru: Создание файла блокировки на

source: Copying the source files over from
ru: Копирование исходных файлов из

source: to
ru: в

source: Copying the main HTML file over from
ru: Копирование основного файла HTML из

source: Building project into
ru: Строительство проекта в
